<H1> Pandas Basics
<H4>-- By Sajal Kapoor

<p><u>Why Pandas?:</u><br>
1. Easy to Import datasets.<br>
2. Data Cleaning made easy.<br>
3. Size mutability.<br>
4. Reshaping and Pivoting of datasets.<br>
6. Efficient manipulation and extraction.<br>
7. Statistical Analysis.

<p><u>Primary Data Structures in Pandas: </u><br>
1. Series -> 1D -> Represents a single column from the entire database -> Homogenous Array (Datatype of all the elements is same) -> Size Immutable (Original Series is unchanged, rather a new one is created).<br>
2. DataFrame -> 2D -> Represents the whole Dataset -> Heterogenous (Can contain data with multiple datatypes) -> Size Mutable (Original DataFrame is affected on making changes).<br>
<b>Note:</b> Both the Data Structures are <b>Labelled Data Structures</b>.

<H3><u>Importing Pandas

In [1]:
import pandas as pd
import numpy as np

## Series

In [2]:
# Creating a series
ser=pd.Series([1,2,3,4,5,"hello"])
ser

0        1
1        2
2        3
3        4
4        5
5    hello
dtype: object

In [3]:
# Checking the datatype
ser.dtype

dtype('O')

In [4]:
# Checking the values
ser.values

array([1, 2, 3, 4, 5, 'hello'], dtype=object)

In [5]:
# Checking the index
ser.index

RangeIndex(start=0, stop=6, step=1)

In [6]:
# Giving a name to the series (column)
ser.name="Test"

In [7]:
# Checking the name of the series (column)
print(ser.name)

Test

<H3><u>Indexing

<p>It can be done in two ways:<br>
1. By using slicing methods. (same way as lists)<br>
2. By using built in methods.

In [8]:
# iloc method -> Location based indexing (The indexes given in the series)
ser.iloc[3]

4

In [9]:
# Printing multiple values
ser.iloc[[1,2,4]]

1    2
2    3
4    5
Name: Test, dtype: object

In [10]:
# The series can be given the index of our choice
index=["one", "two", "three", "four", "five", "text"]
ser.index=index
ser

one          1
two          2
three        3
four         4
five         5
text     hello
Name: Test, dtype: object

In [11]:
# Fetching data using custom indexes
print(ser["three"], ser["text"], sep="\n")

3
hello

In [12]:
# iloc can still be used, but it will take the original (numerical) indexes as the input
# ser.iloc["three"]       # Gives an error
ser.iloc[2]

3

In [13]:
# To use custom indexes, we have a different method
# loc method -> Label based Indexing
ser.loc["three"]

3

<p><b>Note:</b> In Label based indexing, both the start and the stop values are included in the output.

In [14]:
ser.loc["four":"text"]

four        4
five        5
text    hello
Name: Test, dtype: object

In [15]:
# printing multiple values
ser.loc[["one", "three", "text"]]

one          1
three        3
text     hello
Name: Test, dtype: object

<H3><u>Creating a Series using a Dictionary

In [16]:
# A simple fruit-to-color dictionary
fruit_colors = {
    "apple": "red",
    "banana": "yellow",
    "grape": "purple",
    "orange": "orange",
    "lime": "green"
}

In [17]:
fruit_ser=pd.Series(fruit_colors, name="Fruit Colours")
fruit_ser

apple        red
banana    yellow
grape     purple
orange    orange
lime       green
Name: Fruit Colours, dtype: object

<h3><u>Conditional Selection

In [18]:
ser=pd.Series([1,2,3,4,5,6,7,8,9,10], name="Numbers")
ser

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: Numbers, dtype: int64

In [19]:
ser>4

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7     True
8     True
9     True
Name: Numbers, dtype: bool

In [20]:
# Printing the series with a condition
ser[ser<8]

0    1
1    2
2    3
3    4
4    5
5    6
6    7
Name: Numbers, dtype: int64

<h3><u>Logical operators

In [21]:
# Logical AND
(ser>3) & (ser<7)

0    False
1    False
2    False
3     True
4     True
5     True
6    False
7    False
8    False
9    False
Name: Numbers, dtype: bool

In [22]:
# Printing series with above condition
ser[(ser>3)&(ser<7)]

3    4
4    5
5    6
Name: Numbers, dtype: int64

In [23]:
# Logical OR
(ser<3) | (ser>7)

0     True
1     True
2    False
3    False
4    False
5    False
6    False
7     True
8     True
9     True
Name: Numbers, dtype: bool

In [24]:
# Printing series with above condition
ser[(ser<3) | (ser>7)]

0     1
1     2
7     8
8     9
9    10
Name: Numbers, dtype: int64

In [25]:
# Logical NOT
~(ser>7)

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7    False
8    False
9    False
Name: Numbers, dtype: bool

In [26]:
# Printing series with above condition
ser[~(ser>7)]

0    1
1    2
2    3
3    4
4    5
5    6
6    7
Name: Numbers, dtype: int64

<h3><u>Modifying the Series

In [27]:
ser[4]=890
ser     # Modified (new) series

0      1
1      2
2      3
3      4
4    890
5      6
6      7
7      8
8      9
9     10
Name: Numbers, dtype: int64

## DataFrame

In [28]:
data = {
    'Asset_ID': [1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010, 1010],
    'Software_Name': ['VS Code', 'Docker', 'Slack', 'Jira', 'PostgreSQL', 
                      'Python', 'Kubernetes', 'AWS CLI', 'Zoom', 'Tableau', 'Tableau'],
    'Category': ['IDE', 'DevOps', 'Communication', 'Management', 'Database', 
                 'Language', 'DevOps', 'Cloud', 'Communication', 'Analytics', 'Analytics'],
    'Monthly_Cost': [0.00, 15.50, 8.25, 12.00, np.nan, np.nan, 45.00, 0.00, 14.99, 70.00, 70.00],
    'Active_Users': [150, 45, 210, 85, 30, 180, 22, 55, 205, 12, 12],
    'Enterprise_License': [True, True, True, True, False, False, True, False, True, True, True],
    'Last_Update': [
        '2024-01-15', '2023-12-10', '2024-01-20', np.nan, '2024-01-02',
        '2023-10-15', '2024-01-25', '2023-09-12', '2024-01-18', '2023-12-01', '2023-12-01'
    ]
}
data

{'Asset_ID': [1001,
  1002,
  1003,
  1004,
  1005,
  1006,
  1007,
  1008,
  1009,
  1010,
  1010],
 'Software_Name': ['VS Code',
  'Docker',
  'Slack',
  'Jira',
  'PostgreSQL',
  'Python',
  'Kubernetes',
  'AWS CLI',
  'Zoom',
  'Tableau',
  'Tableau'],
 'Category': ['IDE',
  'DevOps',
  'Communication',
  'Management',
  'Database',
  'Language',
  'DevOps',
  'Cloud',
  'Communication',
  'Analytics',
  'Analytics'],
 'Monthly_Cost': [0.0,
  15.5,
  8.25,
  12.0,
  nan,
  nan,
  45.0,
  0.0,
  14.99,
  70.0,
  70.0],
 'Active_Users': [150, 45, 210, 85, 30, 180, 22, 55, 205, 12, 12],
 'Enterprise_License': [True,
  True,
  True,
  True,
  False,
  False,
  True,
  False,
  True,
  True,
  True],
 'Last_Update': ['2024-01-15',
  '2023-12-10',
  '2024-01-20',
  nan,
  '2024-01-02',
  '2023-10-15',
  '2024-01-25',
  '2023-09-12',
  '2024-01-18',
  '2023-12-01',
  '2023-12-01']}

In [29]:
df=pd.DataFrame(data)
df

,Asset_ID,Software_Name,Category,Monthly_Cost,Active_Users,Enterprise_License,Last_Update
0,1001,VS Code,IDE,0.00,150,True,2024-01-15
1,1002,Docker,DevOps,15.50,45,True,2023-12-10
2,1003,Slack,Communication,8.25,210,True,2024-01-20
3,1004,Jira,Management,12.00,85,True,NaN
4,1005,PostgreSQL,Database,NaN,30,False,2024-01-02
5,1006,Python,Language,NaN,180,False,2023-10-15
6,1007,Kubernetes,DevOps,45.00,22,True,2024-01-25
7,1008,AWS CLI,Cloud,0.00,55,False,2023-09-12
8,1009,Zoom,Communication,14.99,205,True,2024-01-18
9,1010,Tableau,Analytics,70.00,12,True,2023-12-01
10,1010,Tableau,Analytics,70.00,12,True,2023-12-01

In [30]:
# printing some starting values
df.head()

,Asset_ID,Software_Name,Category,Monthly_Cost,Active_Users,Enterprise_License,Last_Update
0,1001,VS Code,IDE,0.00,150,True,2024-01-15
1,1002,Docker,DevOps,15.50,45,True,2023-12-10
2,1003,Slack,Communication,8.25,210,True,2024-01-20
3,1004,Jira,Management,12.00,85,True,NaN
4,1005,PostgreSQL,Database,NaN,30,False,2024-01-02

In [31]:
# printing some ending values
df.tail()

,Asset_ID,Software_Name,Category,Monthly_Cost,Active_Users,Enterprise_License,Last_Update
6,1007,Kubernetes,DevOps,45.00,22,True,2024-01-25
7,1008,AWS CLI,Cloud,0.00,55,False,2023-09-12
8,1009,Zoom,Communication,14.99,205,True,2024-01-18
9,1010,Tableau,Analytics,70.00,12,True,2023-12-01
10,1010,Tableau,Analytics,70.00,12,True,2023-12-01

In [32]:
# Display all columns with some records using iloc method
df.iloc[2:5]

,Asset_ID,Software_Name,Category,Monthly_Cost,Active_Users,Enterprise_License,Last_Update
2,1003,Slack,Communication,8.25,210,True,2024-01-20
3,1004,Jira,Management,12.00,85,True,NaN
4,1005,PostgreSQL,Database,NaN,30,False,2024-01-02

In [33]:
# Display some columns with some records using iloc method
df.iloc[2:5, 2:5]       # Rows, Columns

        Category  Monthly_Cost  Active_Users
2  Communication          8.25           210
3     Management         12.00            85
4       Database           NaN            30

In [34]:
# Display some columns with some records with loc method (starting and ending indexes both included)
df.loc[3:7, ["Category", "Last_Update"]]

     Category Last_Update
3  Management         NaN
4    Database  2024-01-02
5    Language  2023-10-15
6      DevOps  2024-01-25
7       Cloud  2023-09-12

In [35]:
# Display all records with some columns
df[["Active_Users", "Enterprise_License"]]

    Active_Users  Enterprise_License
0            150                True
1             45                True
2            210                True
3             85                True
4             30               False
5            180               False
6             22                True
7             55               False
8            205                True
9             12                True
10            12                True

In [36]:
# Dropping a Row/Column without changing the actual dataframe
df.drop("Enterprise_License", axis=1)  # Drop the column
df.drop(4, axis=0)  # Drop the row

,Asset_ID,Software_Name,Category,Monthly_Cost,Active_Users,Enterprise_License,Last_Update
0,1001,VS Code,IDE,0.00,150,True,2024-01-15
1,1002,Docker,DevOps,15.50,45,True,2023-12-10
2,1003,Slack,Communication,8.25,210,True,2024-01-20
3,1004,Jira,Management,12.00,85,True,NaN
5,1006,Python,Language,NaN,180,False,2023-10-15
6,1007,Kubernetes,DevOps,45.00,22,True,2024-01-25
7,1008,AWS CLI,Cloud,0.00,55,False,2023-09-12
8,1009,Zoom,Communication,14.99,205,True,2024-01-18
9,1010,Tableau,Analytics,70.00,12,True,2023-12-01
10,1010,Tableau,Analytics,70.00,12,True,2023-12-01

In [37]:
df      # The actual DataFrame is unaffected by the drop operation

,Asset_ID,Software_Name,Category,Monthly_Cost,Active_Users,Enterprise_License,Last_Update
0,1001,VS Code,IDE,0.00,150,True,2024-01-15
1,1002,Docker,DevOps,15.50,45,True,2023-12-10
2,1003,Slack,Communication,8.25,210,True,2024-01-20
3,1004,Jira,Management,12.00,85,True,NaN
4,1005,PostgreSQL,Database,NaN,30,False,2024-01-02
5,1006,Python,Language,NaN,180,False,2023-10-15
6,1007,Kubernetes,DevOps,45.00,22,True,2024-01-25
7,1008,AWS CLI,Cloud,0.00,55,False,2023-09-12
8,1009,Zoom,Communication,14.99,205,True,2024-01-18
9,1010,Tableau,Analytics,70.00,12,True,2023-12-01
10,1010,Tableau,Analytics,70.00,12,True,2023-12-01

In [38]:
# Dropping a Row/Column from the actual dataframe
df.drop("Enterprise_License", axis=1, inplace=True)  # Drop the column
df.drop(5, axis=0, inplace=True)  # Drop the row
# Setting inplace=True performs the operation "inplace", i.e., on the actual DataFrame.
# By default, inplace=False
df

,Asset_ID,Software_Name,Category,Monthly_Cost,Active_Users,Last_Update
0,1001,VS Code,IDE,0.00,150,2024-01-15
1,1002,Docker,DevOps,15.50,45,2023-12-10
2,1003,Slack,Communication,8.25,210,2024-01-20
3,1004,Jira,Management,12.00,85,NaN
4,1005,PostgreSQL,Database,NaN,30,2024-01-02
6,1007,Kubernetes,DevOps,45.00,22,2024-01-25
7,1008,AWS CLI,Cloud,0.00,55,2023-09-12
8,1009,Zoom,Communication,14.99,205,2024-01-18
9,1010,Tableau,Analytics,70.00,12,2023-12-01
10,1010,Tableau,Analytics,70.00,12,2023-12-01

In [39]:
# Shape of the dataframe
df.shape

(10, 6)

In [40]:
# Checking Datatypes in the dataframe
df.dtypes

Asset_ID           int64
Software_Name     object
Category          object
Monthly_Cost     float64
Active_Users       int64
Last_Update       object
dtype: object

In [41]:
# Displaying info about dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, 0 to 10
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Asset_ID       10 non-null     int64
 1   Software_Name  10 non-null     object
 2   Category       10 non-null     object
 3   Monthly_Cost   9 non-null      float64
 4   Active_Users   10 non-null     int64
 5   Last_Update    9 non-null      object
dtypes: float64(1), int64(2), object(3)
memory usage: 560.0+ bytes

In [42]:
# Display statistical info about dataframe (applicable to some columns which are compatible, mainly with dtype=int or float)
df.describe()

        Asset_ID  Monthly_Cost  Active_Users
count    10.0000      9.000000     10.000000
mean   1005.9000     26.193333     82.600000
std       3.3483     28.122936     77.706285
min    1001.0000      0.000000     12.000000
25%    1003.2500      8.250000     24.000000
50%    1006.0000     14.990000     50.000000
75%    1008.7500     45.000000    133.750000
max    1010.0000     70.000000    210.000000

In [43]:
# Broadcasting in a Dataframe
df["Monthly_Cost"] += 50
df["Monthly_Cost"]

0      50.00
1      65.50
2      58.25
3      62.00
4        NaN
6      95.00
7      50.00
8      64.99
9     120.00
10    120.00
Name: Monthly_Cost, dtype: float64

In [44]:
# Renaming a Column (Actual change in DataFrame)
df.rename(columns={"Monthly_Cost":"Cost"}, inplace=True)
df

    Asset_ID Software_Name       Category    Cost  Active_Users Last_Update
0       1001       VS Code            IDE   50.00           150  2024-01-15
1       1002        Docker         DevOps   65.50            45  2023-12-10
2       1003         Slack  Communication   58.25           210  2024-01-20
3       1004          Jira     Management   62.00            85         NaN
4       1005    PostgreSQL       Database     NaN            30  2024-01-02
6       1007    Kubernetes         DevOps   95.00            22  2024-01-25
7       1008       AWS CLI          Cloud   50.00            55  2023-09-12
8       1009          Zoom  Communication   64.99           205  2024-01-18
9       1010       Tableau      Analytics  120.00            12  2023-12-01
10      1010       Tableau      Analytics  120.00            12  2023-12-01

In [45]:
# Displaying all the unique values in a column
df["Active_Users"].unique()

array([150,  45, 210,  85,  30,  22,  55, 205,  12])

In [46]:
# Value Counts of a column
df["Category"].value_counts()

Category
DevOps           2
Communication    2
Analytics        2
IDE              1
Management       1
Database         1
Cloud            1
Name: count, dtype: int64

In [47]:
# Creating a new column in a DataFrame
df["Yearly_Cost"]=df["Cost"]*8200
df

,Asset_ID,Software_Name,Category,Cost,Active_Users,Last_Update,Yearly_Cost
0,1001,VS Code,IDE,50.00,150,2024-01-15,410000.0
1,1002,Docker,DevOps,65.50,45,2023-12-10,537100.0
2,1003,Slack,Communication,58.25,210,2024-01-20,477650.0
3,1004,Jira,Management,62.00,85,NaN,508400.0
4,1005,PostgreSQL,Database,NaN,30,2024-01-02,NaN
6,1007,Kubernetes,DevOps,95.00,22,2024-01-25,779000.0
7,1008,AWS CLI,Cloud,50.00,55,2023-09-12,410000.0
8,1009,Zoom,Communication,64.99,205,2024-01-18,532918.0
9,1010,Tableau,Analytics,120.00,12,2023-12-01,984000.0
10,1010,Tableau,Analytics,120.00,12,2023-12-01,984000.0

## Data Cleaning

<H3><u> Dealing with Missing Values

In [48]:
# Check for the null values in the dataframe
df.isnull()

,Asset_ID,Software_Name,Category,Cost,Active_Users,Last_Update,Yearly_Cost
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,True,False
4,False,False,False,True,False,False,True
6,False,False,False,False,False,False,False
7,False,False,False,False,False,False,False
8,False,False,False,False,False,False,False
9,False,False,False,False,False,False,False
10,False,False,False,False,False,False,False

In [49]:
# Check for the no. of null values in the dataframe
df.isnull().sum()

Asset_ID         0
Software_Name    0
Category         0
Cost             1
Active_Users     0
Last_Update      1
Yearly_Cost      1
dtype: int64

In [50]:
# Dropping the records with any type of null values (inplace=False)
df.dropna(how="any")

,Asset_ID,Software_Name,Category,Cost,Active_Users,Last_Update,Yearly_Cost
0,1001,VS Code,IDE,50.00,150,2024-01-15,410000.0
1,1002,Docker,DevOps,65.50,45,2023-12-10,537100.0
2,1003,Slack,Communication,58.25,210,2024-01-20,477650.0
6,1007,Kubernetes,DevOps,95.00,22,2024-01-25,779000.0
7,1008,AWS CLI,Cloud,50.00,55,2023-09-12,410000.0
8,1009,Zoom,Communication,64.99,205,2024-01-18,532918.0
9,1010,Tableau,Analytics,120.00,12,2023-12-01,984000.0
10,1010,Tableau,Analytics,120.00,12,2023-12-01,984000.0

In [51]:
# Dropping the records with all the values as null values (inplace=False)
df.dropna(how="all")

,Asset_ID,Software_Name,Category,Cost,Active_Users,Last_Update,Yearly_Cost
0,1001,VS Code,IDE,50.00,150,2024-01-15,410000.0
1,1002,Docker,DevOps,65.50,45,2023-12-10,537100.0
2,1003,Slack,Communication,58.25,210,2024-01-20,477650.0
3,1004,Jira,Management,62.00,85,NaN,508400.0
4,1005,PostgreSQL,Database,NaN,30,2024-01-02,NaN
6,1007,Kubernetes,DevOps,95.00,22,2024-01-25,779000.0
7,1008,AWS CLI,Cloud,50.00,55,2023-09-12,410000.0
8,1009,Zoom,Communication,64.99,205,2024-01-18,532918.0
9,1010,Tableau,Analytics,120.00,12,2023-12-01,984000.0
10,1010,Tableau,Analytics,120.00,12,2023-12-01,984000.0

In [52]:
# Filling the null values with a particular value (inplace=False)
df.fillna(0)

,Asset_ID,Software_Name,Category,Cost,Active_Users,Last_Update,Yearly_Cost
0,1001,VS Code,IDE,50.00,150,2024-01-15,410000.0
1,1002,Docker,DevOps,65.50,45,2023-12-10,537100.0
2,1003,Slack,Communication,58.25,210,2024-01-20,477650.0
3,1004,Jira,Management,62.00,85,0,508400.0
4,1005,PostgreSQL,Database,0.00,30,2024-01-02,0.0
6,1007,Kubernetes,DevOps,95.00,22,2024-01-25,779000.0
7,1008,AWS CLI,Cloud,50.00,55,2023-09-12,410000.0
8,1009,Zoom,Communication,64.99,205,2024-01-18,532918.0
9,1010,Tableau,Analytics,120.00,12,2023-12-01,984000.0
10,1010,Tableau,Analytics,120.00,12,2023-12-01,984000.0

In [53]:
# Filling the Null value in column "Yearly_Cost" with the mean of the column (inplace=False)
df["Yearly_Cost"].fillna(df["Yearly_Cost"].mean())
# Similarly, According to the need, the null values can be replaced with mean, median, mode, or any other values.

0     410000.000000
1     537100.000000
2     477650.000000
3     508400.000000
4     624785.333333
6     779000.000000
7     410000.000000
8     532918.000000
9     984000.000000
10    984000.000000
Name: Yearly_Cost, dtype: float64

<H4>NOTE:</H4>
<p>fillna() method has two types:<br>
1. Forward fill -> fills with the first occuring value (just before null value) from top to bottom.<br>
2. Backward fill -> fills the first occuring value (just before null value) from bottom to top.<br>
<br>
Just pass the parameter: <b>method="ffill"</b> for Forward fill and <b>method="bfill"</b><br>
<br>
If the first or the last value is null, then it will remain null if:<br>
1. Forward fill is used in case of first value is null.<br>
2. Backward fill is used in case of last value is null.

In [54]:
# Replacing any value with another value (Inplace=True)
df["Category"].replace("DevOps", "Development Operations", inplace=True)      # Element to be replaced, New Element

C:\Users\sajal\AppData\Local\Temp\ipykernel_11760\3798668219.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Category"].replace("DevOps", "Development Operations", inplace=True)      # Element to be replaced, New Element

<H3><u>Dealing with Duplicate Values

In [55]:
# Check for Duplicate values in the dataframe
dup=df[df.duplicated(keep="first")]     # keep="first" parameter keeps the first occurrence and marks the rest as duplicates
dup

,Asset_ID,Software_Name,Category,Cost,Active_Users,Last_Update,Yearly_Cost
10,1010,Tableau,Analytics,120.0,12,2023-12-01,984000.0

In [56]:
# Check for Duplicate values in the dataframe
dup=df[df.duplicated(keep="last")]     # keep="last" parameter keeps the last occurrence and marks the rest as duplicates
dup

,Asset_ID,Software_Name,Category,Cost,Active_Users,Last_Update,Yearly_Cost
9,1010,Tableau,Analytics,120.0,12,2023-12-01,984000.0

In [57]:
# Dropping Duplicates
df.drop_duplicates(keep="first", inplace=True)   # keep="first" parameter keeps the first occurrence and drops the rest as duplicates
df

,Asset_ID,Software_Name,Category,Cost,Active_Users,Last_Update,Yearly_Cost
0,1001,VS Code,IDE,50.00,150,2024-01-15,410000.0
1,1002,Docker,Development Operations,65.50,45,2023-12-10,537100.0
2,1003,Slack,Communication,58.25,210,2024-01-20,477650.0
3,1004,Jira,Management,62.00,85,NaN,508400.0
4,1005,PostgreSQL,Database,NaN,30,2024-01-02,NaN
6,1007,Kubernetes,Development Operations,95.00,22,2024-01-25,779000.0
7,1008,AWS CLI,Cloud,50.00,55,2023-09-12,410000.0
8,1009,Zoom,Communication,64.99,205,2024-01-18,532918.0
9,1010,Tableau,Analytics,120.00,12,2023-12-01,984000.0

<h3><u>Dealing with Invalid Values

In [58]:
# Using Lambda function
df["Yearly_Cost"]=df["Yearly_Cost"].apply(lambda x: x/10 if x>500000 else x)
df

,Asset_ID,Software_Name,Category,Cost,Active_Users,Last_Update,Yearly_Cost
0,1001,VS Code,IDE,50.00,150,2024-01-15,410000.0
1,1002,Docker,Development Operations,65.50,45,2023-12-10,53710.0
2,1003,Slack,Communication,58.25,210,2024-01-20,477650.0
3,1004,Jira,Management,62.00,85,NaN,50840.0
4,1005,PostgreSQL,Database,NaN,30,2024-01-02,NaN
6,1007,Kubernetes,Development Operations,95.00,22,2024-01-25,77900.0
7,1008,AWS CLI,Cloud,50.00,55,2023-09-12,410000.0
8,1009,Zoom,Communication,64.99,205,2024-01-18,53291.8
9,1010,Tableau,Analytics,120.00,12,2023-12-01,98400.0

In [59]:
# In case of columns with values like "Category_name" OR "Category Name", use this method to operate
colname="Category"
df["ColFirstName", "ColLastName"]=df[colname].str.split(" ")
df

,Asset_ID,Software_Name,Category,Cost,Active_Users,Last_Update,Yearly_Cost,"(ColFirstName, ColLastName)"
0,1001,VS Code,IDE,50.00,150,2024-01-15,410000.0,[IDE]
1,1002,Docker,Development Operations,65.50,45,2023-12-10,53710.0,"[Development, Operations]"
2,1003,Slack,Communication,58.25,210,2024-01-20,477650.0,[Communication]
3,1004,Jira,Management,62.00,85,NaN,50840.0,[Management]
4,1005,PostgreSQL,Database,NaN,30,2024-01-02,NaN,[Database]
6,1007,Kubernetes,Development Operations,95.00,22,2024-01-25,77900.0,"[Development, Operations]"
7,1008,AWS CLI,Cloud,50.00,55,2023-09-12,410000.0,[Cloud]
8,1009,Zoom,Communication,64.99,205,2024-01-18,53291.8,[Communication]
9,1010,Tableau,Analytics,120.00,12,2023-12-01,98400.0,[Analytics]

<H3><u> Apply and Lambda Functions

In [60]:
# If I want to multiply Cost by 20 (using only apply and a defined function)
def multiplyage(x):
    return x*20

df["Cost"]=df["Cost"].apply(multiplyage)
df

,Asset_ID,Software_Name,Category,Cost,Active_Users,Last_Update,Yearly_Cost,"(ColFirstName, ColLastName)"
0,1001,VS Code,IDE,1000.0,150,2024-01-15,410000.0,[IDE]
1,1002,Docker,Development Operations,1310.0,45,2023-12-10,53710.0,"[Development, Operations]"
2,1003,Slack,Communication,1165.0,210,2024-01-20,477650.0,[Communication]
3,1004,Jira,Management,1240.0,85,NaN,50840.0,[Management]
4,1005,PostgreSQL,Database,NaN,30,2024-01-02,NaN,[Database]
6,1007,Kubernetes,Development Operations,1900.0,22,2024-01-25,77900.0,"[Development, Operations]"
7,1008,AWS CLI,Cloud,1000.0,55,2023-09-12,410000.0,[Cloud]
8,1009,Zoom,Communication,1299.8,205,2024-01-18,53291.8,[Communication]
9,1010,Tableau,Analytics,2400.0,12,2023-12-01,98400.0,[Analytics]

In [ ]:
# If I want to divide Cost by 20 (using apply and lambda function)
df["Cost"]=df["Cost"].apply(lambda x: x/20)
df

,Asset_ID,Software_Name,Category,Cost,Active_Users,Last_Update,Yearly_Cost,"(ColFirstName, ColLastName)"
0,1001,VS Code,IDE,50.00,150,2024-01-15,410000.0,[IDE]
1,1002,Docker,Development Operations,65.50,45,2023-12-10,53710.0,"[Development, Operations]"
2,1003,Slack,Communication,58.25,210,2024-01-20,477650.0,[Communication]
3,1004,Jira,Management,62.00,85,NaN,50840.0,[Management]
4,1005,PostgreSQL,Database,NaN,30,2024-01-02,NaN,[Database]
6,1007,Kubernetes,Development Operations,95.00,22,2024-01-25,77900.0,"[Development, Operations]"
7,1008,AWS CLI,Cloud,50.00,55,2023-09-12,410000.0,[Cloud]
8,1009,Zoom,Communication,64.99,205,2024-01-18,53291.8,[Communication]
9,1010,Tableau,Analytics,120.00,12,2023-12-01,98400.0,[Analytics]

<h3><u> Joins

<p>There are 4 main types of Joins:<br>
1. Inner Join<br>
2. Outer Join<br>
3. Left Join<br>
4. Right Join<br>
<br>
For more details, please visit https://youtu.be/vtgDGrUiUKk?si=JvRCaxOwj1apVU3k&t=3394

In [65]:
# DataFrame - 1
data = {
    'Transaction_ID': [101, 102, 103, 104, 105, 106, 107, 108],
    'Date': ['2023-10-01', '2023-10-01', '2023-10-02', '2023-10-02', '2023-10-03', '2023-10-03', '2023-10-04', '2023-10-04'],
    'Customer_Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Eve', 'Bob', 'Frank', 'Eve'],
    'Product': ['Laptop', 'Mouse', 'Monitor', 'Mouse', 'Keyboard', 'Laptop', 'Monitor', 'Headphones'],
    'Quantity': [1, 2, 1, 1, 3, 1, 2, 1],
    'Price_Per_Unit': [1200, 25, 300, 25, 75, 1200, 300, 150],
    'Region': ['North', 'South', 'East', 'North', 'West', 'South', 'East', 'West']
}

df1 = pd.DataFrame(data)
df1

,Transaction_ID,Date,Customer_Name,Product,Quantity,Price_Per_Unit,Region
0,101,2023-10-01,Alice,Laptop,1,1200,North
1,102,2023-10-01,Bob,Mouse,2,25,South
2,103,2023-10-02,Charlie,Monitor,1,300,East
3,104,2023-10-02,Alice,Mouse,1,25,North
4,105,2023-10-03,Eve,Keyboard,3,75,West
5,106,2023-10-03,Bob,Laptop,1,1200,South
6,107,2023-10-04,Frank,Monitor,2,300,East
7,108,2023-10-04,Eve,Headphones,1,150,West

In [66]:
# DataFrame - 2
customer_info = {
    'Customer_Name': ['Alice', 'Bob', 'Charlie', 'Eve', 'Frank', 'Grace'],
    'Join_Date': ['2021-05-12', '2022-01-10', '2023-03-15', '2021-11-20', '2023-08-05', '2023-12-01'],
    'Loyalty_Program': ['Gold', 'Silver', 'Bronze', 'Gold', 'Bronze', 'None'],
    'Email_Sub': [True, False, True, True, False, True]
}

df2 = pd.DataFrame(customer_info)
df2

  Customer_Name   Join_Date Loyalty_Program  Email_Sub
0         Alice  2021-05-12            Gold       True
1           Bob  2022-01-10          Silver      False
2       Charlie  2023-03-15          Bronze       True
3           Eve  2021-11-20            Gold       True
4         Frank  2023-08-05          Bronze      False
5         Grace  2023-12-01            None       True

In [ ]:
# Concatenation
df=pd.concat([df1,df2], axis=1)
df

,Transaction_ID,Date,Customer_Name,Product,Quantity,Price_Per_Unit,Region,Customer_Name,Join_Date,Loyalty_Program,Email_Sub
0,101,2023-10-01,Alice,Laptop,1,1200,North,Alice,2021-05-12,Gold,True
1,102,2023-10-01,Bob,Mouse,2,25,South,Bob,2022-01-10,Silver,False
2,103,2023-10-02,Charlie,Monitor,1,300,East,Charlie,2023-03-15,Bronze,True
3,104,2023-10-02,Alice,Mouse,1,25,North,Eve,2021-11-20,Gold,True
4,105,2023-10-03,Eve,Keyboard,3,75,West,Frank,2023-08-05,Bronze,False
5,106,2023-10-03,Bob,Laptop,1,1200,South,Grace,2023-12-01,None,True
6,107,2023-10-04,Frank,Monitor,2,300,East,NaN,NaN,NaN,NaN
7,108,2023-10-04,Eve,Headphones,1,150,West,NaN,NaN,NaN,NaN

In [71]:
# Mergeing
df_merged=pd.merge(df1,df2,on="Customer_Name")
df_merged

,Transaction_ID,Date,Customer_Name,Product,Quantity,Price_Per_Unit,Region,Join_Date,Loyalty_Program,Email_Sub
0,101,2023-10-01,Alice,Laptop,1,1200,North,2021-05-12,Gold,True
1,102,2023-10-01,Bob,Mouse,2,25,South,2022-01-10,Silver,False
2,103,2023-10-02,Charlie,Monitor,1,300,East,2023-03-15,Bronze,True
3,104,2023-10-02,Alice,Mouse,1,25,North,2021-05-12,Gold,True
4,105,2023-10-03,Eve,Keyboard,3,75,West,2021-11-20,Gold,True
5,106,2023-10-03,Bob,Laptop,1,1200,South,2022-01-10,Silver,False
6,107,2023-10-04,Frank,Monitor,2,300,East,2023-08-05,Bronze,False
7,108,2023-10-04,Eve,Headphones,1,150,West,2021-11-20,Gold,True

<H3><u>Importing Files

In [74]:
df=pd.read_csv("sample_data.csv")
df

   ID           Name  Age   Department  Salary   Join_Date
0   1  Alice Johnson   28        Sales   50000  2020-01-15
1   2      Bob Smith   34  Engineering   75000  2018-06-20
2   3    Carol Davis   29    Marketing   55000  2019-03-10
3   4   David Wilson   41        Sales   65000  2017-11-05
4   5     Emma Brown   26  Engineering   60000  2021-02-14
5   6   Frank Miller   35      Finance   70000  2019-08-22
6   7      Grace Lee   31    Marketing   58000  2020-05-30
7   8   Henry Taylor   27  Engineering   62000  2021-01-11
8   9   Ivy Anderson   33        Sales   60000  2018-09-18
9  10    Jack Thomas   38      Finance   72000  2017-12-01

In [75]:
df.shape

(10, 6)

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   Salary      10 non-null     int64
 5   Join_Date   10 non-null     object
dtypes: int64(3), object(3)
memory usage: 612.0+ bytes

In [78]:
df.dtypes

ID             int64
Name          object
Age            int64
Department    object
Salary         int64
Join_Date     object
dtype: object

<h3><u>Converting to Datetime datatype

In [80]:
df["Join_Date"]=pd.to_datetime(df["Join_Date"])
df.dtypes

ID                     int64
Name                  object
Age                    int64
Department            object
Salary                 int64
Join_Date     datetime64[ns]
dtype: object

<p>Similarly, the features can be converted into appropriate datatypes using pandas